Revit 2026 API

# ElectricalAnalyticalNodeType Enumeration

---

The type of electrical analytical node.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalAnalyticalNodeType
```
```vb
Public Enumeration ElectricalAnalyticalNodeType
```
```cpp
public enum class ElectricalAnalyticalNodeType
```
```fsharp
type ElectricalAnalyticalNodeType
```

| Member name | Value | Description |
| --- | --- | --- |
| Bus | 1 | Bus |
| EquipmentLoad | 4 | Equipment Load |
| PowerSource | 0 | Power Source |
| TransferSwitch | 3 | Transfer Switch |
| Transformer | 2 | Transformer |

#### Reference

Autodesk.Revit.DB.Electrical Namespace